SWA/first.org

#+TITLE: First Lecture
#+AUTHOR: Maximilian Ivan Filipov
#+OPTIONS: toc:t


\pagebreak
* Quiz
\vspace*{0.5cm}
** snowcards
- atomic requirement
- collected into requirement categories
** user requirements
- document of flow of operations
- are written from a user point of view
** user story mapping
- sorting importance of task
\pagebreak
\vspace*{-4cm}
*  Unified Modeling Language ( UML )
** Behaviour Diagram
**** Activity Diagram
**** State Machine Diagram
**** Use Case Diagram
**** Sequence Diagram
** Structure Diagram
**** Class Diagram
**** Component Diagram
**** Object Diagram
\vspace*{0.5cm}

* USE CASE DIAGRAM
** Diagrams
**** System
**** Actors
**** Primary and Secondary Actors
**** Use cases
**** Relationships
** Use case calls
**** main \Rightarrow included use case
**** main \Leftarrow extends use case
** extension points
**** optional operation ( if \ else )

** Specialized use cases
**** like polymophism / inheritance

* magic draw 10.18. -> Folie
