SWA/first.tex
% Created 2022-11-10 Thu 11:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Maximilian Ivan Filipov}
\date{\today}
\title{First Lecture}
\hypersetup{
 pdfauthor={Maximilian Ivan Filipov},
 pdftitle={First Lecture},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\pagebreak
\section{Quiz}
\label{sec:org25c7afb}
\vspace*{0.5cm}
\subsection{snowcards}
\label{sec:org5bd24d5}
\begin{itemize}
\item atomic requirement
\item collected into requirement categories
\end{itemize}
\subsection{user requirements}
\label{sec:orga3803a6}
\begin{itemize}
\item document of flow of operations
\item are written from a user point of view
\end{itemize}
\subsection{user story mapping}
\label{sec:orgc83af14}
\begin{itemize}
\item sorting importance of task
\end{itemize}
\pagebreak
\vspace*{-4cm}
\section{Unified Modeling Language ( UML )}
\label{sec:org37287d6}
\subsection{Behaviour Diagram}
\label{sec:orge5854cc}
\begin{enumerate}
\item Activity Diagram
\label{sec:org0407e35}
\item State Machine Diagram
\label{sec:org2d61c22}
\item Use Case Diagram
\label{sec:org175ba39}
\item Sequence Diagram
\label{sec:orgc9e4e88}
\end{enumerate}
\subsection{Structure Diagram}
\label{sec:org05f5ce9}
\begin{enumerate}
\item Class Diagram
\label{sec:orgfe40575}
\item Component Diagram
\label{sec:orgc4135b2}
\item Object Diagram
\label{sec:orgdf742e2}
\vspace*{0.5cm}
\end{enumerate}

\section{USE CASE DIAGRAM}
\label{sec:org8495ea8}
\subsection{Diagrams}
\label{sec:org9ad1601}
\begin{enumerate}
\item System
\label{sec:orgaea35e2}
\item Actors
\label{sec:org8b1faf7}
\item Primary and Secondary Actors
\label{sec:orgc3379dc}
\item Use cases
\label{sec:org810ff33}
\item Relationships
\label{sec:org38f3c70}
\end{enumerate}
\subsection{Use case calls}
\label{sec:org1b85dd9}
\begin{enumerate}
\item main \(\Rightarrow\) included use case
\label{sec:org36fa5a2}
\item main \(\Leftarrow\) extends use case
\label{sec:org627de36}
\end{enumerate}
\subsection{extension points}
\label{sec:orgd9e3100}
\begin{enumerate}
\item optional operation ( if $\backslash$ else )
\label{sec:org3e1cd6b}
\end{enumerate}

\subsection{Specialized use cases}
\label{sec:org623795a}
\begin{enumerate}
\item like polymophism / inheritance
\label{sec:orgf023a1f}
\end{enumerate}
\end{document}